In [1]:
import numpy as np

In [2]:
a=np.array([1,2,3,5,6,7])
a

array([1, 2, 3, 5, 6, 7])

In [3]:
a=np.array([1,2,3,5,6,7],dtype="float")
a

array([1., 2., 3., 5., 6., 7.])

## pandas library
- It is an important module in   data science3 library.
- Stands for pannel data.
- Data Strctures
  - series
  - data frames
- With which we can do the data analysis,manuplation,cleaning.
- Data analysation
  - statistic of the data.
  - volume of the data
- Data manuplation
  - Changing data from one form to the another.
  - Merging and concatenation.
- Data Cleaning
  - Removing  unwanted data.
  - Deleting null values and nan values.. etc!

In [4]:
import pandas as pd

In [5]:
pd.__version__

'1.2.4'

In [6]:
# we creatre the pandas series with list,string,tuple,dictionary
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [8]:
#how to create pandas series with 
c=pd.Series("Holla  hii helo")
c

0    Holla  hii helo
dtype: object

In [10]:
b=input()
c=pd.Series(b)
c

hello ...!

0    hello ...!
dtype: object

In [11]:
b=input()
c=pd.Series(b.split(' '))
c

hii this is deekshitha

0           hii
1          this
2            is
3    deekshitha
dtype: object

In [12]:
t=(1,2,3,4,5,6)
t1=pd.Series(t)
t1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [13]:
t=[1,2,3,4,5,6]
t1=pd.Series(t)
t1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [19]:
d=pd.Series(range(0,4))
d

0    0
1    1
2    2
3    3
dtype: int64

In [18]:
dic={"list":[1,2,3],"tuple":(3,4,5),"string":"hii","int":123}
dic

{'list': [1, 2, 3], 'tuple': (3, 4, 5), 'string': 'hii', 'int': 123}

In [21]:
dic1=pd.Series(dic)
dic1

list      [1, 2, 3]
tuple     (3, 4, 5)
string          hii
int             123
dtype: object

In [22]:
arr=np.arange(10,50,5)
arr

array([10, 15, 20, 25, 30, 35, 40, 45])

In [23]:
arr1=pd.Series(arr)
arr1

0    10
1    15
2    20
3    25
4    30
5    35
6    40
7    45
dtype: int32

In [24]:
len(arr1)

8

In [25]:
arr1[len(arr1)-1]

45

In [26]:
arr1[0:2]

0    10
1    15
dtype: int32

In [27]:
arr1.index

RangeIndex(start=0, stop=8, step=1)

In [28]:
arr1.index=[222354,5,3654,433,546,4653,654546,546]
arr1

222354    10
5         15
3654      20
433       25
546       30
4653      35
654546    40
546       45
dtype: int32

In [29]:
li=["deeksh","sandy","raji"]
pd.Series(li,index=(1,2,3))

1    deeksh
2     sandy
3      raji
dtype: object

In [30]:
li=["deeksh","sandy","raji"]
ind=[i for i in range(15,18)] # list comprehension
pd.Series(li,index=ind)

15    deeksh
16     sandy
17      raji
dtype: object

In [31]:
dict2=pd.Series(dic,index=ind)

In [32]:
dict2

15    NaN
16    NaN
17    NaN
dtype: object

In [33]:
dict2.index

Int64Index([15, 16, 17], dtype='int64')

In [35]:
dic1

list      [1, 2, 3]
tuple     (3, 4, 5)
string          hii
int             123
dtype: object

In [36]:
import pandas as pd
import numpy as np
pd.DataFrame(dic) # it has row and column indexing

   list  tuple string  int
0     1      3    hii  123
1     2      4    hii  123
2     3      5    hii  123

In [45]:
data={56:"fiftysix","float":1.345,"prgm":"py","name":"da"}
data

{56: 'fiftysix', 'float': 1.345, 'prgm': 'py', 'name': 'da'}

In [43]:
df2=pd.DataFrame(data,index="raji had mental @vrsec".split(" "))
df2

              56  float prgm name
raji    fiftysix  1.345   py   da
had     fiftysix  1.345   py   da
mental  fiftysix  1.345   py   da
@vrsec  fiftysix  1.345   py   da

In [47]:
df1=pd.DataFrame(dic)

In [48]:
pd.concat([df1,df2])

        list  tuple string    int        56  float prgm name
0        1.0    3.0    hii  123.0       NaN    NaN  NaN  NaN
1        2.0    4.0    hii  123.0       NaN    NaN  NaN  NaN
2        3.0    5.0    hii  123.0       NaN    NaN  NaN  NaN
raji     NaN    NaN    NaN    NaN  fiftysix  1.345   py   da
had      NaN    NaN    NaN    NaN  fiftysix  1.345   py   da
mental   NaN    NaN    NaN    NaN  fiftysix  1.345   py   da
@vrsec   NaN    NaN    NaN    NaN  fiftysix  1.345   py   da

In [51]:
dict3={"first":[1,2,3,4],"Second":[5,6,7,8],"Three":(9,0,1,2)}
dict3

{'first': [1, 2, 3, 4], 'Second': [5, 6, 7, 8], 'Three': (9, 0, 1, 2)}

In [50]:
df3=pd.DataFrame(dict3,index=[2001,2002,2003,2004])
df3

      first  Second  Three
2001      1       5      9
2002      2       6      0
2003      3       7      1
2004      4       8      2

In [65]:
df4=pd.DataFrame({"for":[11,52,53,4],"five":[52,6,37,38],"six":(97,0,17,28)})
df4

   for  five  six
0   11    52   97
1   52     6    0
2   53    37   17
3    4    38   28

In [58]:
df3.join(df4)

      first  Second  Three  fouth  fifth  sixth
2001      1       5      9    NaN    NaN    NaN
2002      2       6      0   52.0    6.0    0.0
2003      3       7      1   53.0   37.0   17.0
2004      4       8      2    NaN    NaN    NaN

In [59]:
df4.join(df3)

      fouth  fifth  sixth  first  Second  Three
2008     11     52     97    NaN     NaN    NaN
2002     52      6      0    2.0     6.0    0.0
2003     53     37     17    3.0     7.0    1.0
2006      4     38     28    NaN     NaN    NaN

In [68]:
df5=pd.DataFrame({"for":[11,52,5,4],"five":[52,6,37,38],"six":(97,0,17,28)})

In [69]:
df5.merge(df4)

   for  five  six
0   11    52   97
1   52     6    0
2    4    38   28

In [73]:
df5.merge(df4,on='six')

   for_x  five_x  six  for_y  five_y
0     11      52   97     11      52
1     52       6    0     52       6
2      5      37   17     53      37
3      4      38   28      4      38

In [17]:
import pandas as pd

In [18]:
df5=pd.DataFrame({"for":[11,52,5,4],"five":[52,6,37,38],"six":(97,0,17,28)})

In [14]:
df4=pd.DataFrame({"for":[11,52,53,4],"five":[52,6,37,38],"six":(97,0,17,28)})

In [23]:
#help(df6.merge)
new=df5.merge(df4)
new.columns=["ab","ba","cd"]
new.index=(30,40)
new

ValueError: Length mismatch: Expected axis has 3 elements, new values have 2 elements

In [19]:
dt=pd.date_range('2022-01-01','2022-01-15')
dt

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14', '2022-01-15'],
              dtype='datetime64[ns]', freq='D')

In [20]:
dt=pd.date_range('2022-01-01','2022-01-15',periods=6)
dt

DatetimeIndex(['2022-01-01 00:00:00', '2022-01-03 19:12:00',
               '2022-01-06 14:24:00', '2022-01-09 09:36:00',
               '2022-01-12 04:48:00', '2022-01-15 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [21]:
dt=pd.date_range('2022-01-01','2022-01-15',periods=6)
pd.Series(dt)

0   2022-01-01 00:00:00
1   2022-01-03 19:12:00
2   2022-01-06 14:24:00
3   2022-01-09 09:36:00
4   2022-01-12 04:48:00
5   2022-01-15 00:00:00
dtype: datetime64[ns]

In [22]:
temp=[34,23,15,56,7,8]
pd.Series(temp,index=dt)

2022-01-01 00:00:00    34
2022-01-03 19:12:00    23
2022-01-06 14:24:00    15
2022-01-09 09:36:00    56
2022-01-12 04:48:00     7
2022-01-15 00:00:00     8
dtype: int64

In [26]:
temp=[23,54,53,56,76,21]
dt4=pd.Series(temp,index=dt)

In [27]:
dt4["2022-01-05"]

Series([], dtype: int64)

## Working with .csv files
 - reading .csv file with "read_csv()" method.
 - syntax:- pd.read_csv("flie location")

In [33]:
# Reading data
data=pd.read_csv("deekshu.csv")
data

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [34]:
#sample
data.sample()

  Roll Name  Maths  Discrete  OS    CO  DS
3   A2    H     40        60  73  50.0 NaN

In [35]:
data.sample()

  Roll Name  Maths  Discrete  OS    CO  DS
4   B1    I     50        70  90  90.0 NaN

In [36]:
data.sample()

  Roll Name  Maths  Discrete  OS  CO    DS
8   D1    M     40        70  50 NaN  90.0

In [38]:
data.sample(3)

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
6    C1    K     67        70  30  75.0  40.0
11   E2    Y     60        45  77  73.0  40.0

In [40]:
#Head by default it will return values of first 
data.head()

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        70  30  70.0  90.0
1   A2    Y     90        45  67  73.0  50.0
2   A1    G     60        70  30   NaN  90.0
3   A2    H     40        60  73  50.0   NaN
4   B1    I     50        70  90  90.0   NaN

In [41]:
data.head(3) #customize

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        70  30  70.0  90.0
1   A2    Y     90        45  67  73.0  50.0
2   A1    G     60        70  30   NaN  90.0

In [42]:
#tail -opp to head returns bottom values of the table
data.tail()

   Roll Name  Maths  Discrete  OS    CO    DS
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [45]:
data.tail(2)

   Roll Name  Maths  Discrete  OS    CO    DS
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [46]:
data["Maths"]

0     60
1     90
2     60
3     40
4     50
5     63
6     67
7     91
8     40
9      5
10    50
11    60
Name: Maths, dtype: int64

In [53]:
data[["OS","DS"]]

    OS    DS
0   30  90.0
1   67  50.0
2   30  90.0
3   73   NaN
4   90   NaN
5   67  50.0
6   30  40.0
7   67  50.0
8   50  90.0
9   65   NaN
10  30  90.0
11  77  40.0

In [54]:
data[["OS","DS","Maths"]] # for accessing multiple values

    OS    DS  Maths
0   30  90.0     60
1   67  50.0     90
2   30  90.0     60
3   73   NaN     40
4   90   NaN     50
5   67  50.0     63
6   30  40.0     67
7   67  50.0     91
8   50  90.0     40
9   65   NaN      5
10  30  90.0     50
11  77  40.0     60

In [55]:
data.sample()

  Roll Name  Maths  Discrete  OS    CO    DS
1   A2    Y     90        45  67  73.0  50.0

In [57]:
new=pd.read_csv("marks.csv",usecols=["Name","Maths"])

FileNotFoundError: [Errno 2] No such file or directory: 'marks.csv'

In [58]:
new

   ab  ba  cd
0  11  52  97
1  52   6   0
2   4  38  28

In [59]:
data.dtypes

Roll         object
Name         object
Maths         int64
Discrete      int64
OS            int64
CO          float64
DS          float64
dtype: object

In [60]:
data.info

<bound method DataFrame.info of    Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0>

In [61]:
data.describe()

           Maths   Discrete         OS         CO         DS
count  12.000000  12.000000  12.000000  10.000000   9.000000
mean   56.333333  60.583333  56.333333  68.900000  65.555556
std    22.928083  11.851032  21.465970  13.042239  23.511227
min     5.000000  45.000000  30.000000  50.000000  40.000000
25%    47.500000  45.000000  30.000000  59.500000  50.000000
50%    60.000000  68.500000  66.000000  72.500000  50.000000
75%    64.000000  70.000000  68.500000  74.500000  90.000000
max    91.000000  70.000000  90.000000  90.000000  90.000000

In [64]:
data.Maths.value_counts() #to get frequency of a p

60    3
50    2
40    2
67    1
5     1
90    1
91    1
63    1
Name: Maths, dtype: int64

In [65]:
data["Maths"].value_counts()

60    3
50    2
40    2
67    1
5     1
90    1
91    1
63    1
Name: Maths, dtype: int64

In [66]:
data.shape

(12, 7)

In [67]:
data.sort_values("Roll")

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
2    A1    G     60        70  30   NaN  90.0
1    A2    Y     90        45  67  73.0  50.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [68]:
data.sort_values("Roll",ascending=False)

   Roll Name  Maths  Discrete  OS    CO    DS
11   E2    Y     60        45  77  73.0  40.0
10   E1    X     50        70  30  80.0  90.0
9    D2    N      5        67  65  50.0   NaN
8    D1    M     40        70  50   NaN  90.0
7    C2    L     91        45  67  72.0  50.0
6    C1    K     67        70  30  75.0  40.0
5    B2    J     63        45  67  56.0  50.0
4    B1    I     50        70  90  90.0   NaN
1    A2    Y     90        45  67  73.0  50.0
3    A2    H     40        60  73  50.0   NaN
0    A1    X     60        70  30  70.0  90.0
2    A1    G     60        70  30   NaN  90.0

In [70]:
data["total"]=100
data

   Roll Name  Maths  Discrete  OS    CO    DS  total
0    A1    X     60        70  30  70.0  90.0    100
1    A2    Y     90        45  67  73.0  50.0    100
2    A1    G     60        70  30   NaN  90.0    100
3    A2    H     40        60  73  50.0   NaN    100
4    B1    I     50        70  90  90.0   NaN    100
5    B2    J     63        45  67  56.0  50.0    100
6    C1    K     67        70  30  75.0  40.0    100
7    C2    L     91        45  67  72.0  50.0    100
8    D1    M     40        70  50   NaN  90.0    100
9    D2    N      5        67  65  50.0   NaN    100
10   E1    X     50        70  30  80.0  90.0    100
11   E2    Y     60        45  77  73.0  40.0    100

In [71]:
data.Maths.sum()

676

In [72]:
data.DS.sum()

590.0

In [73]:
data.isnull()

     Roll   Name  Maths  Discrete     OS     CO     DS  total
0   False  False  False     False  False  False  False  False
1   False  False  False     False  False  False  False  False
2   False  False  False     False  False   True  False  False
3   False  False  False     False  False  False   True  False
4   False  False  False     False  False  False   True  False
5   False  False  False     False  False  False  False  False
6   False  False  False     False  False  False  False  False
7   False  False  False     False  False  False  False  False
8   False  False  False     False  False   True  False  False
9   False  False  False     False  False  False   True  False
10  False  False  False     False  False  False  False  False
11  False  False  False     False  False  False  False  False

In [74]:
data.isna()

     Roll   Name  Maths  Discrete     OS     CO     DS  total
0   False  False  False     False  False  False  False  False
1   False  False  False     False  False  False  False  False
2   False  False  False     False  False   True  False  False
3   False  False  False     False  False  False   True  False
4   False  False  False     False  False  False   True  False
5   False  False  False     False  False  False  False  False
6   False  False  False     False  False  False  False  False
7   False  False  False     False  False  False  False  False
8   False  False  False     False  False   True  False  False
9   False  False  False     False  False  False   True  False
10  False  False  False     False  False  False  False  False
11  False  False  False     False  False  False  False  False

In [77]:
data.isnull().sum()

Roll        0
Name        0
Maths       0
Discrete    0
OS          0
CO          2
DS          3
total       0
dtype: int64

In [78]:
data.nunique()

Roll        10
Name        10
Maths        8
Discrete     4
OS           7
CO           8
DS           3
total        1
dtype: int64

In [79]:
clean=data.dropna()

In [80]:
clean

   Roll Name  Maths  Discrete  OS    CO    DS  total
0    A1    X     60        70  30  70.0  90.0    100
1    A2    Y     90        45  67  73.0  50.0    100
5    B2    J     63        45  67  56.0  50.0    100
6    C1    K     67        70  30  75.0  40.0    100
7    C2    L     91        45  67  72.0  50.0    100
10   E1    X     50        70  30  80.0  90.0    100
11   E2    Y     60        45  77  73.0  40.0    100